Catalogs/HD_ПовесткиСобранийСобственников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>HD_ПовесткиСобранийСобственников</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вопрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулировкаПредложенияРешенияВопроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкаПользовательскихПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектДляСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Падеж</Name>
							<Type>
								<v8:Type>cfg:EnumRef.HD_Падежи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/HD_Падежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>HD_Падежи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Именительный</Name>
					<Comment>Кто? Что?</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Родительный</Name>
					<Comment>Кого? Чего?</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дательный</Name>
					<Comment>Кому? Чему?</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Винительный</Name>
					<Comment>Кого? Что?</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Творительный</Name>
					<Comment>Кем? Чем?</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предложный</Name>
					<Comment>О ком? О чём?</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КакЕсть</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/HD_ПовесткиСобранийСобственников/Forms/ФормаЭлемента/Ext/Form/Module.bsl
//HD+
// При открытии и при создании элемента настраивает видимость полей по флагу ЭтоПриложение.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьВидимостьПолейПриложения(ЭтотОбъект);
	
КонецПроцедуры //HD-

//HD+
// При смене флага ЭтоПриложение спрашивает подтверждение, если в скрываемых полях есть текст.
// При отказе возвращает флажок; при согласии очищает скрываемые поля и переключает видимость.
//
&НаКлиенте
Процедура ЭтоПриложениеПриИзменении(Элемент)
	
	Если Объект.ЭтоПриложение Тогда
		НужноПодтверждение = ЗначениеЗаполнено(Объект.Вопрос)
			ИЛИ ЗначениеЗаполнено(Объект.ФормулировкаПредложенияРешенияВопроса);
		ТекстВопроса = НСтр("ru = 'Содержимое полей «Вопрос» и «Формулировка предложения решения вопроса» будет удалено. Вы уверены?'");
	Иначе
		НужноПодтверждение = ЗначениеЗаполнено(Объект.Приложение);
		ТекстВопроса = НСтр("ru = 'Содержимое поля «Приложение» будет удалено. Вы уверены?'");
	КонецЕсли;
	
	Если НЕ НужноПодтверждение Тогда
		НастроитьВидимостьПолейПриложения(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЭтоПриложениеПриИзмененииЗавершение", ЭтотОбъект);
	
	ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
	ПараметрыВопроса.Заголовок = НСтр("ru = 'Подтверждение'");
	ПараметрыВопроса.КнопкаПоУмолчанию = КодВозвратаДиалога.Нет;
	ПараметрыВопроса.Картинка = БиблиотекаКартинок.Предупреждение32;
	
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
		Оповещение,
		ТекстВопроса,
		РежимДиалогаВопрос.ДаНет,
		ПараметрыВопроса);
	
КонецПроцедуры //HD-

//HD+
// Обработка ответа на вопрос при смене ЭтоПриложение: Да — очистка скрываемых полей; иначе откат флага.
//
&НаКлиенте
Процедура ЭтоПриложениеПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ЗначениеОтвета = Неопределено;
	Если ТипЗнч(РезультатВопроса) = Тип("Структура") Тогда
		РезультатВопроса.Свойство("Значение", ЗначениеОтвета);
	КонецЕсли;
	
	Если ЗначениеОтвета <> КодВозвратаДиалога.Да Тогда
		Объект.ЭтоПриложение = НЕ Объект.ЭтоПриложение;
		Возврат;
	КонецЕсли;
	
	Если Объект.ЭтоПриложение Тогда
		Объект.Вопрос = "";
		Объект.ФормулировкаПредложенияРешенияВопроса = "";
	Иначе
		Объект.Приложение = "";
	КонецЕсли;
	
	НастроитьВидимостьПолейПриложения(ЭтотОбъект);
	
КонецПроцедуры //HD-

//HD+
// Если ЭтоПриложение = Истина — видны только поле Приложение; иначе — Вопрос и формулировка предложения.
//
&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьПолейПриложения(Форма)
	
	ЭтоПриложение = Форма.Объект.ЭтоПриложение;
	
	Форма.Элементы.Вопрос.Видимость = НЕ ЭтоПриложение;
	Форма.Элементы.ФормулировкаПредложенияРешенияВопроса.Видимость = НЕ ЭтоПриложение;
	Форма.Элементы.Приложение.Видимость = ЭтоПриложение;
	
КонецПроцедуры //HD-

//HD+
// Команда формы: ищет параметры вида [ИмяПараметра] в текстах пункта повестки
// (Вопрос, ФормулировкаПредложенияРешенияВопроса и Приложение)
// и заполняет табличную часть НастройкаПользовательскихПараметров.
//
&НаКлиенте
Процедура НайтиПараметры(Команда)
	ЗаполнитьНастройкуПользовательскихПараметровНаСервере();
КонецПроцедуры //HD-

//HD+
// Заполняет ТЧ НастройкаПользовательскихПараметров найденными именами без дублей.
// Источники текста — те же поля, что копируются в документ: вопрос, формулировка, приложение.
// ТипПараметра, ОбъектДляСвязи и Падеж — из словаря известных имён либо по эвристикам.
//
&НаСервере
Процедура ЗаполнитьНастройкуПользовательскихПараметровНаСервере()
	
	Объект.НастройкаПользовательскихПараметров.Очистить();
	
	НайденныеПараметры = Новый Массив;
	УжеЕсть = Новый Соответствие; // Ключ = имя параметра
	
	ИзвлечьПараметрыИзТекста(Строка(Объект.Вопрос), НайденныеПараметры, УжеЕсть);
	ИзвлечьПараметрыИзТекста(Строка(Объект.ФормулировкаПредложенияРешенияВопроса), НайденныеПараметры, УжеЕсть);
	ИзвлечьПараметрыИзТекста(Строка(Объект.Приложение), НайденныеПараметры, УжеЕсть);
	
	СловарьНастроек = ПолучитьСловарьНастроекПользовательскихПараметров();
	
	Для Каждого ИмяПараметра Из НайденныеПараметры Цикл
		НоваяСтрока = Объект.НастройкаПользовательскихПараметров.Добавить();
		НоваяСтрока.Параметр = ИмяПараметра;
		ЗаполнитьАвтонастройкиПараметра(НоваяСтрока, СловарьНастроек);
	КонецЦикла;
	
КонецПроцедуры //HD-

//HD+
// Извлекает параметры вида [ИмяПараметра] из текста и добавляет их в массив в порядке первого появления.
// Маркеры опциональных блоков [?Имя] и [/?Имя] пропускаются (это не параметры настройки).
//
&НаСервере
Процедура ИзвлечьПараметрыИзТекста(Текст, НайденныеПараметры, УжеЕсть)
	
	Если НЕ ЗначениеЗаполнено(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	ПозицияПоиска = 1;
	Пока ПозицияПоиска > 0 Цикл
		
		ПозицияОткрывающей = СтрНайти(Текст, "[", НаправлениеПоиска.СНачала, ПозицияПоиска);
		Если ПозицияОткрывающей = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ПозицияЗакрывающей = СтрНайти(Текст, "]", НаправлениеПоиска.СНачала, ПозицияОткрывающей + 1);
		Если ПозицияЗакрывающей = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ИмяПараметра = СокрЛП(Сред(Текст, ПозицияОткрывающей + 1, ПозицияЗакрывающей - ПозицияОткрывающей - 1));
		
		//HD+ Пропуск маркеров опционального блока [?Имя] / [/?Имя]
		ЭтоМаркерОпциональногоБлока = Ложь;
		Если ЗначениеЗаполнено(ИмяПараметра) Тогда
			Если Лев(ИмяПараметра, 1) = "?" Тогда
				ЭтоМаркерОпциональногоБлока = Истина;
			ИначеЕсли Лев(ИмяПараметра, 2) = "/?" Тогда
				ЭтоМаркерОпциональногоБлока = Истина;
			КонецЕсли;
		КонецЕсли;
		//HD-
		
		Если ЗначениеЗаполнено(ИмяПараметра) И НЕ ЭтоМаркерОпциональногоБлока Тогда
			Если УжеЕсть.Получить(ИмяПараметра) = Неопределено Тогда
				УжеЕсть.Вставить(ИмяПараметра, Истина);
				НайденныеПараметры.Добавить(ИмяПараметра);
			КонецЕсли;
		КонецЕсли;
		
		ПозицияПоиска = ПозицияЗакрывающей + 1;
		
	КонецЦикла;
	
КонецПроцедуры //HD-

//HD+
// Заполняет ТипПараметра, ОбъектДляСвязи и Падеж строки ТЧ: сначала словарь (целиком), иначе эвристики.
//
&НаСервере
Процедура ЗаполнитьАвтонастройкиПараметра(СтрокаПараметра, СловарьНастроек)
	
	ИмяПараметра = СокрЛП(Строка(СтрокаПараметра.Параметр));
	НастройкаИзСловаря = СловарьНастроек.Получить(ИмяПараметра);
	
	Если НастройкаИзСловаря <> Неопределено Тогда
		СтрокаПараметра.ТипПараметра = НастройкаИзСловаря.ТипПараметра;
		СтрокаПараметра.ОбъектДляСвязи = НастройкаИзСловаря.ОбъектДляСвязи;
		СтрокаПараметра.Падеж = НастройкаИзСловаря.Падеж;
		Возврат;
	КонецЕсли;
	
	НастройкаПоЭвристикам = ПолучитьАвтонастройкиПараметраПоЭвристикам(ИмяПараметра);
	СтрокаПараметра.ТипПараметра = НастройкаПоЭвристикам.ТипПараметра;
	СтрокаПараметра.ОбъектДляСвязи = НастройкаПоЭвристикам.ОбъектДляСвязи;
	СтрокаПараметра.Падеж = НастройкаПоЭвристикам.Падеж;
	
КонецПроцедуры //HD-

//HD+
// Словарь известных имён параметров повестки: ТипПараметра, ОбъектДляСвязи, Падеж.
// Приоритет над эвристиками. Пополнять по мере разбора формулировок.
//
&НаСервере
Функция ПолучитьСловарьНастроекПользовательскихПараметров()
	
	Словарь = Новый Соответствие;
	
	ДобавитьНастройкуВСловарьПараметров(Словарь, "МКД_Улица",
		"Строка", "Объект.МКД_Улица", Перечисления.HD_Падежи.КакЕсть);
	ДобавитьНастройкуВСловарьПараметров(Словарь, "МКД_НомерДома",
		"Строка", "Объект.МКД_НомерДома", Перечисления.HD_Падежи.КакЕсть);
	
	//HD+ База и падежные варианты: в документе значение заполняется один раз и синхронизируется по группе
	ДобавитьНастройкуВСловарьПараметров(Словарь, "Арендатор",
		"Справочник.бит_Проживающие,Строка", "", Перечисления.HD_Падежи.Именительный);
	ДобавитьНастройкуВСловарьПараметров(Словарь, "Арендатор_Именительный",
		"Справочник.бит_Проживающие,Строка", "", Перечисления.HD_Падежи.Именительный);
	ДобавитьНастройкуВСловарьПараметров(Словарь, "Арендатор_Творительный",
		"Справочник.бит_Проживающие,Строка", "", Перечисления.HD_Падежи.Творительный);
	ДобавитьНастройкуВСловарьПараметров(Словарь, "Арендатор_Дательный",
		"Справочник.бит_Проживающие,Строка", "", Перечисления.HD_Падежи.Дательный);
	ДобавитьНастройкуВСловарьПараметров(Словарь, "Арендатор_Родительный",
		"Справочник.бит_Проживающие,Строка", "", Перечисления.HD_Падежи.Родительный);
	ДобавитьНастройкуВСловарьПараметров(Словарь, "Арендатор_Винительный",
		"Справочник.бит_Проживающие,Строка", "", Перечисления.HD_Падежи.Винительный);
	ДобавитьНастройкуВСловарьПараметров(Словарь, "Арендатор_Предложный",
		"Справочник.бит_Проживающие,Строка", "", Перечисления.HD_Падежи.Предложный);
	//HD-
	
	ДобавитьНастройкуВСловарьПараметров(Словарь, "ДоговорДатаДень",
		"Число", "", Перечисления.HD_Падежи.КакЕсть);
	ДобавитьНастройкуВСловарьПараметров(Словарь, "ДоговорДатаМесяц",
		"Число", "", Перечисления.HD_Падежи.КакЕсть);
	ДобавитьНастройкуВСловарьПараметров(Словарь, "ДоговорДатаГод",
		"Число", "", Перечисления.HD_Падежи.КакЕсть);
	
	ДобавитьНастройкуВСловарьПараметров(Словарь, "ВЦелях",
		"Строка", "", Перечисления.HD_Падежи.КакЕсть);
	ДобавитьНастройкуВСловарьПараметров(Словарь, "ОбъектОбщегоИмущества",
		"Строка", "", Перечисления.HD_Падежи.Творительный);
	ДобавитьНастройкуВСловарьПараметров(Словарь, "ЦельИспользованияОбщегоИмущества",
		"Строка", "", Перечисления.HD_Падежи.КакЕсть);
	
	ДобавитьНастройкуВСловарьПараметров(Словарь, "СписокПредложенныхЧленовСовета",
		"Строка", "Объект.СписокПредложенныхЧленовСовета", Перечисления.HD_Падежи.КакЕсть);
	ДобавитьНастройкуВСловарьПараметров(Словарь, "ПредложенныйПредседатель",
		"Строка", "Объект.ПредложенныйПредседатель", Перечисления.HD_Падежи.КакЕсть);
	ДобавитьНастройкуВСловарьПараметров(Словарь, "КоммунальныеРесурсыСОИ",
		"Строка", "", Перечисления.HD_Падежи.КакЕсть);
	
	Возврат Словарь;
	
КонецФункции //HD-

//HD+
// Добавляет в словарь запись настройки параметра.
//
&НаСервере
Процедура ДобавитьНастройкуВСловарьПараметров(Словарь, ИмяПараметра, ТипПараметра, ОбъектДляСвязи, Падеж)
	
	Настройка = Новый Структура;
	Настройка.Вставить("ТипПараметра", ТипПараметра);
	Настройка.Вставить("ОбъектДляСвязи", ОбъектДляСвязи);
	Настройка.Вставить("Падеж", Падеж);
	
	Словарь.Вставить(ИмяПараметра, Настройка);
	
КонецПроцедуры //HD-

//HD+
// Эвристики по имени параметра, если записи нет в словаре.
//
&НаСервере
Функция ПолучитьАвтонастройкиПараметраПоЭвристикам(Знач ИмяПараметра)
	
	Настройка = Новый Структура;
	Настройка.Вставить("ТипПараметра", ОпределитьТипПараметраПоИмени(ИмяПараметра));
	Настройка.Вставить("ОбъектДляСвязи", ОпределитьОбъектДляСвязиПоИмени(ИмяПараметра));
	Настройка.Вставить("Падеж", ОпределитьПадежПараметраПоИмени(ИмяПараметра));
	
	Возврат Настройка;
	
КонецФункции //HD-

//HD+
// Падеж по суффиксу имени (_Дательный и т.п.); иначе КакЕсть.
//
&НаСервере
Функция ОпределитьПадежПараметраПоИмени(Знач ИмяПараметра)
	
	Если ИмяПараметраЗаканчиваетсяНа(ИмяПараметра, "_Именительный") Тогда
		Возврат Перечисления.HD_Падежи.Именительный;
	ИначеЕсли ИмяПараметраЗаканчиваетсяНа(ИмяПараметра, "_Родительный") Тогда
		Возврат Перечисления.HD_Падежи.Родительный;
	ИначеЕсли ИмяПараметраЗаканчиваетсяНа(ИмяПараметра, "_Дательный") Тогда
		Возврат Перечисления.HD_Падежи.Дательный;
	ИначеЕсли ИмяПараметраЗаканчиваетсяНа(ИмяПараметра, "_Винительный") Тогда
		Возврат Перечисления.HD_Падежи.Винительный;
	ИначеЕсли ИмяПараметраЗаканчиваетсяНа(ИмяПараметра, "_Творительный") Тогда
		Возврат Перечисления.HD_Падежи.Творительный;
	ИначеЕсли ИмяПараметраЗаканчиваетсяНа(ИмяПараметра, "_Предложный") Тогда
		Возврат Перечисления.HD_Падежи.Предложный;
	КонецЕсли;
	
	Возврат Перечисления.HD_Падежи.КакЕсть;
	
КонецФункции //HD-

//HD+
// Тип по шаблону имени; по умолчанию Строка.
//
&НаСервере
Функция ОпределитьТипПараметраПоИмени(Знач ИмяПараметра)
	
	ИмяПараметраВерх = ВРег(ИмяПараметра);
	
	Если Лев(ИмяПараметраВерх, СтрДлина("АРЕНДАТОР")) = "АРЕНДАТОР" Тогда
		Возврат "Справочник.бит_Проживающие,Строка";
	КонецЕсли;
	
	Если СтрНайти(ИмяПараметраВерх, "ПРОЖИВАЮЩ") > 0 Тогда
		Возврат "Справочник.бит_Проживающие";
	КонецЕсли;
	
	Если ИмяПараметраЗаканчиваетсяНа(ИмяПараметраВерх, "ДЕНЬ")
		ИЛИ ИмяПараметраЗаканчиваетсяНа(ИмяПараметраВерх, "МЕСЯЦ")
		ИЛИ ИмяПараметраЗаканчиваетсяНа(ИмяПараметраВерх, "ГОД")
		ИЛИ СтрНайти(ИмяПараметраВерх, "ДАТАДЕНЬ") > 0
		ИЛИ СтрНайти(ИмяПараметраВерх, "ДАТАМЕСЯЦ") > 0
		ИЛИ СтрНайти(ИмяПараметраВерх, "ДАТАГОД") > 0 Тогда
		Возврат "Число";
	КонецЕсли;
	
	Возврат "Строка";
	
КонецФункции //HD-

//HD+
// ОбъектДляСвязи: если имя параметра совпадает с реквизитом Документы.HD_ОбщееСобраниеСобственников — «Объект.<Имя>».
// Иначе пустая строка (табличные части и произвольные параметры не связываются автоматически).
//
&НаСервере
Функция ОпределитьОбъектДляСвязиПоИмени(Знач ИмяПараметра)
	
	ИмяПараметра = СокрЛП(Строка(ИмяПараметра));
	Если НЕ ЗначениеЗаполнено(ИмяПараметра) Тогда
		Возврат "";
	КонецЕсли;
	
	РеквизитДокумента = Метаданные.Документы.HD_ОбщееСобраниеСобственников.Реквизиты.Найти(ИмяПараметра);
	Если РеквизитДокумента = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "Объект." + РеквизитДокумента.Имя;
	
КонецФункции //HD-

//HD+
// Проверяет, заканчивается ли имя параметра на указанный суффикс (без учёта регистра через заранее приведённые строки).
//
&НаСервере
Функция ИмяПараметраЗаканчиваетсяНа(Знач ИмяПараметра, Знач Суффикс)
	
	ДлинаСуффикса = СтрДлина(Суффикс);
	Если ДлинаСуффикса = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрДлина(ИмяПараметра) < ДлинаСуффикса Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Прав(ИмяПараметра, ДлинаСуффикса) = Суффикс;
	
КонецФункции //HD-
